Revit 2027 API
PanelScheduleTemplate.GetPanelScheduleType Method
 Returns the panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelScheduleType GetPanelScheduleType()
Public Function GetPanelScheduleType As PanelScheduleType
public:
PanelScheduleType GetPanelScheduleType()
member GetPanelScheduleType : unit -> PanelScheduleType
Return Value
PanelScheduleType
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace